{
    "format": "graph-model",
    "generatedBy": "2.11.0",
    "convertedBy": "TensorFlow.js Converter v4.2.0",
    "signature": {
        "inputs": {
            "input_13": {
                "name": "input_13:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "1024"
                        },
                        {
                            "size": "1"
                        }
                    ]
                }
            }
        },
        "outputs": {
            "dense_12": {
                "name": "Identity:0",
                "dtype": "DT_FLOAT",
                "tensorShape": {
                    "dim": [
                        {
                            "size": "-1"
                        },
                        {
                            "size": "1"
                        }
                    ]
                }
            }
        }
    },
    "modelTopology": {
        "node": [
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_24/Conv1D/ExpandDims/dim",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    },
                    "dtype": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_24/Conv1D/ExpandDims_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "8"
                                    },
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_24/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_25/Conv1D/ExpandDims/dim",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_25/Conv1D/ExpandDims_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "5"
                                    },
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_25/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "256"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/last_conv/Conv1D/ExpandDims/dim",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/last_conv/Conv1D/ExpandDims_1",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    },
                                    {
                                        "size": "3"
                                    },
                                    {
                                        "size": "256"
                                    },
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/last_conv/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/mul",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/sub",
                "op": "Const",
                "attr": {
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    }
                                ]
                            }
                        }
                    },
                    "dtype": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/global_average_pooling1d_12/Mean/reduction_indices",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_INT32"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_INT32",
                            "tensorShape": {}
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/dense_12/MatMul/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "128"
                                    },
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/dense_12/BiasAdd/ReadVariableOp",
                "op": "Const",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "value": {
                        "tensor": {
                            "dtype": "DT_FLOAT",
                            "tensorShape": {
                                "dim": [
                                    {
                                        "size": "1"
                                    }
                                ]
                            }
                        }
                    }
                }
            },
            {
                "name": "input_13",
                "op": "Placeholder",
                "attr": {
                    "dtype": {
                        "type": "DT_FLOAT"
                    },
                    "shape": {
                        "shape": {
                            "dim": [
                                {
                                    "size": "-1"
                                },
                                {
                                    "size": "1024"
                                },
                                {
                                    "size": "1"
                                }
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_24/Conv1D/ExpandDims",
                "op": "ExpandDims",
                "input": [
                    "input_13",
                    "StatefulPartitionedCall/model_230/conv1d_24/Conv1D/ExpandDims/dim"
                ],
                "attr": {
                    "Tdim": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_24/Conv1D",
                "op": "_FusedConv2D",
                "input": [
                    "StatefulPartitionedCall/model_230/conv1d_24/Conv1D/ExpandDims",
                    "StatefulPartitionedCall/model_230/conv1d_24/Conv1D/ExpandDims_1",
                    "StatefulPartitionedCall/model_230/conv1d_24/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "strides": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "dilations": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "data_format": {
                        "s": "TkhXQw=="
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "use_cudnn_on_gpu": {
                        "b": true
                    },
                    "padding": {
                        "s": "U0FNRQ=="
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "explicit_paddings": {
                        "list": {}
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_24/BiasAdd",
                "op": "Squeeze",
                "input": [
                    "StatefulPartitionedCall/model_230/conv1d_24/Conv1D"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "squeeze_dims": {
                        "list": {
                            "i": [
                                "-3"
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/model_230/conv1d_24/BiasAdd",
                    "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/add_1",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/mul_1",
                    "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/sub"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/activation_36/Relu",
                "op": "Relu",
                "input": [
                    "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/add_1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_25/Conv1D/ExpandDims",
                "op": "ExpandDims",
                "input": [
                    "StatefulPartitionedCall/model_230/activation_36/Relu",
                    "StatefulPartitionedCall/model_230/conv1d_25/Conv1D/ExpandDims/dim"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "Tdim": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_25/Conv1D",
                "op": "_FusedConv2D",
                "input": [
                    "StatefulPartitionedCall/model_230/conv1d_25/Conv1D/ExpandDims",
                    "StatefulPartitionedCall/model_230/conv1d_25/Conv1D/ExpandDims_1",
                    "StatefulPartitionedCall/model_230/conv1d_25/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "strides": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "explicit_paddings": {
                        "list": {}
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "use_cudnn_on_gpu": {
                        "b": true
                    },
                    "dilations": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "padding": {
                        "s": "U0FNRQ=="
                    },
                    "data_format": {
                        "s": "TkhXQw=="
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/conv1d_25/BiasAdd",
                "op": "Squeeze",
                "input": [
                    "StatefulPartitionedCall/model_230/conv1d_25/Conv1D"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "squeeze_dims": {
                        "list": {
                            "i": [
                                "-3"
                            ]
                        }
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/model_230/conv1d_25/BiasAdd",
                    "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/add_1",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/mul_1",
                    "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/sub"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/activation_37/Relu",
                "op": "Relu",
                "input": [
                    "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/add_1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/last_conv/Conv1D/ExpandDims",
                "op": "ExpandDims",
                "input": [
                    "StatefulPartitionedCall/model_230/activation_37/Relu",
                    "StatefulPartitionedCall/model_230/last_conv/Conv1D/ExpandDims/dim"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "Tdim": {
                        "type": "DT_INT32"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/last_conv/Conv1D",
                "op": "_FusedConv2D",
                "input": [
                    "StatefulPartitionedCall/model_230/last_conv/Conv1D/ExpandDims",
                    "StatefulPartitionedCall/model_230/last_conv/Conv1D/ExpandDims_1",
                    "StatefulPartitionedCall/model_230/last_conv/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "use_cudnn_on_gpu": {
                        "b": true
                    },
                    "padding": {
                        "s": "U0FNRQ=="
                    },
                    "data_format": {
                        "s": "TkhXQw=="
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "strides": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "num_args": {
                        "i": "1"
                    },
                    "explicit_paddings": {
                        "list": {}
                    },
                    "dilations": {
                        "list": {
                            "i": [
                                "1",
                                "1",
                                "1",
                                "1"
                            ]
                        }
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/last_conv/BiasAdd",
                "op": "Squeeze",
                "input": [
                    "StatefulPartitionedCall/model_230/last_conv/Conv1D"
                ],
                "attr": {
                    "squeeze_dims": {
                        "list": {
                            "i": [
                                "-3"
                            ]
                        }
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/mul_1",
                "op": "Mul",
                "input": [
                    "StatefulPartitionedCall/model_230/last_conv/BiasAdd",
                    "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/mul"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/add_1",
                "op": "AddV2",
                "input": [
                    "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/mul_1",
                    "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/sub"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/activation_38/Relu",
                "op": "Relu",
                "input": [
                    "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/add_1"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/global_average_pooling1d_12/Mean",
                "op": "Mean",
                "input": [
                    "StatefulPartitionedCall/model_230/activation_38/Relu",
                    "StatefulPartitionedCall/model_230/global_average_pooling1d_12/Mean/reduction_indices"
                ],
                "attr": {
                    "Tidx": {
                        "type": "DT_INT32"
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    },
                    "keep_dims": {
                        "b": false
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/dense_12/BiasAdd",
                "op": "_FusedMatMul",
                "input": [
                    "StatefulPartitionedCall/model_230/global_average_pooling1d_12/Mean",
                    "StatefulPartitionedCall/model_230/dense_12/MatMul/ReadVariableOp",
                    "StatefulPartitionedCall/model_230/dense_12/BiasAdd/ReadVariableOp"
                ],
                "device": "/device:CPU:0",
                "attr": {
                    "num_args": {
                        "i": "1"
                    },
                    "transpose_a": {
                        "b": false
                    },
                    "transpose_b": {
                        "b": false
                    },
                    "leakyrelu_alpha": {
                        "f": 0.2
                    },
                    "fused_ops": {
                        "list": {
                            "s": [
                                "Qmlhc0FkZA=="
                            ]
                        }
                    },
                    "epsilon": {
                        "f": 0.0
                    },
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "StatefulPartitionedCall/model_230/dense_12/Sigmoid",
                "op": "Sigmoid",
                "input": [
                    "StatefulPartitionedCall/model_230/dense_12/BiasAdd"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            },
            {
                "name": "Identity",
                "op": "Identity",
                "input": [
                    "StatefulPartitionedCall/model_230/dense_12/Sigmoid"
                ],
                "attr": {
                    "T": {
                        "type": "DT_FLOAT"
                    }
                }
            }
        ],
        "library": {},
        "versions": {
            "producer": 1205
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "StatefulPartitionedCall/model_230/conv1d_24/Conv1D/ExpandDims/dim",
                    "shape": [],
                    "dtype": "int32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/conv1d_24/Conv1D/ExpandDims_1",
                    "shape": [
                        1,
                        8,
                        1,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/conv1d_24/BiasAdd/ReadVariableOp",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/mul",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/batch_normalization_36/batchnorm/sub",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/conv1d_25/Conv1D/ExpandDims/dim",
                    "shape": [],
                    "dtype": "int32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/conv1d_25/Conv1D/ExpandDims_1",
                    "shape": [
                        1,
                        5,
                        128,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/conv1d_25/BiasAdd/ReadVariableOp",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/mul",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/batch_normalization_37/batchnorm/sub",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/last_conv/Conv1D/ExpandDims/dim",
                    "shape": [],
                    "dtype": "int32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/last_conv/Conv1D/ExpandDims_1",
                    "shape": [
                        1,
                        3,
                        256,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/last_conv/BiasAdd/ReadVariableOp",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/mul",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/batch_normalization_38/batchnorm/sub",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/global_average_pooling1d_12/Mean/reduction_indices",
                    "shape": [],
                    "dtype": "int32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/dense_12/MatMul/ReadVariableOp",
                    "shape": [
                        128,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "StatefulPartitionedCall/model_230/dense_12/BiasAdd/ReadVariableOp",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}